app/controllers/api/v1/users_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 0], ["LIMIT", 1]]
---
  def show
    respond_with User.find(params[:id])

INSERT INTO "users" ("email", "encrypted_password", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"
---
  def create
    user=User.new(user_params)

    if user.save

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
UPDATE "users" SET "email" = $1, "encrypted_password" = $2, "updated_at" = $3 WHERE "users"."id" = $4  [["email", "railsatrtpi@gmail.com"], ["encrypted_password", "$2a$11$WtaCKAKxGqQ.krFjZ/tuBe4OJu0hdrmYLivqOtmkCd0S29AdsTHty"], ["updated_at", "2019-11-18 18:25:49.531776"], ["id", 2]]
---
  def update
    user = User.find(params[:id])

    if user.update(user_params)